RedditClone/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "author_id", "post_id") VALUES ($1, $2, $3) RETURNING "id"  [["content", "sdfasdfasdfas"], ["author_id", 1], ["post_id", 9]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.author_id = current_user.id
    if @comment.save