RedditClone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @subs = Sub.all
    if @post.save
---
SELECT "subs".* FROM "subs"
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "adfaf"], ["url", "adfafaf"], ["content", "adfadfadfadf"], ["author_id", 1], ["created_at", "2019-07-09 20:27:13.680014"], ["updated_at", "2019-07-09 20:27:13.680014"]]

  def edit
    @subs = Sub.all
    @post = Post.find(params[:id])
---
SELECT "subs".* FROM "subs" WHERE 1=0
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def update
    @post = Post.find(params[:id])
    @post.author_id = current_user.id
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Dogs are great "], ["updated_at", "2019-07-09 20:51:06.206136"], ["id", 7]]