RedditClone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "cat"], ["updated_at", "2019-07-09 18:11:18.205503"], ["id", 1]]
---
  def update
    @sub = Sub.find(params[:id])

    if @sub.update(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
   def ensure_moderator
    @sub = Sub.find(params[:id])