RedditClone/app/views/posts/new.html.erb

      name="post[sub_ids][]"
      <%= "checked" if @post.sub_ids.include?(sub.id) %>
---
SELECT  1 AS one FROM "post_subs" WHERE "post_subs"."sub_id" = $1 AND "post_subs"."post_id" IS NULL LIMIT $2  [["sub_id", 2], ["LIMIT", 1]]
SELECT "subs".* FROM "subs"